# SQL CRUD 

In this activity, you will apply `SQL` CRUD operations to a database of account payments. You will need to SELECT and filter data using SQL then INSERT, UPDATE, and DELETE records from the tables.

## Instructions

Complete the following steps:

1. Import the SQLAlchemy module.

2. Create a database connection string that imports the `bank_payments.db` from the Resources folder.

3. Create a [database engine object](https://docs.sqlalchemy.org/en/14/core/engines.html) that utilizes the database connection string.

4. Get a list of the tables included in the in the database.

5. Run a query that `SELECT`s all of the data from the `banks` table.

6. Using a SQL `SELECT` statement, find the bank routing number of the bank where the bank name equals 'TD Bank'. List the bank routing number to confirm.

7. Insert a new bank into the `banks` table. Once the query has been executed, confirm that the bank has been added to the list.
   * Use a '10' for the `bank_id`.
   * The bank name will be 'Royal Bank of Canada'.
   * The bank routing number will be '000300002'.
   
   
8. `WHERE` the bank id equals 10, `UPDATE` the bank name to 'RBC'. Confirm that the bank name has been updated.

9. `DELETE` the bank where the bank id equals to 3 from `banks` table. Confirm that the bank has been deleted.

## 1. Import the SQLAlchemy module.

In [1]:
# Import modules
import pandas as pd
import sqlalchemy

## 2. Create a database connection string that imports the `bank_payments.db` from the Resources folder.

In [2]:
# Database connection string
database_connection_string = 'sqlite:///../Resources/bank_payments.db'

## 3. Create a [database engine object](https://docs.sqlalchemy.org/en/14/core/engines.html) that utilizes the database connection string.

In [3]:
# Database engine
engine = sqlalchemy.create_engine(database_connection_string, echo=True)

## 4. Get a list of the tables included in the in the database.

In [4]:
# Get table names from the database
engine.table_names()

2022-02-10 20:23:38,053 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2022-02-10 20:23:38,057 INFO sqlalchemy.engine.Engine [raw sql] ()

C:\Users\dlpst\anaconda3\envs\dev\envs\dev\lib\site-packages\ipykernel_launcher.py:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)

['banks', 'customer', 'payments']

## 5. Run a query that `SELECT`s all of the data from the `banks` table.

In [11]:
# Select all of the data from the banks table
sql_select = """
SELECT * FROM banks
"""

# Execute the sql statement
results = engine.execute(sql_select)

# List the query results
list(results)

2022-02-10 20:26:20,746 INFO sqlalchemy.engine.Engine
SELECT * FROM banks

2022-02-10 20:26:20,747 INFO sqlalchemy.engine.Engine [raw sql] ()

[('bank_id', 'bank_name', 'bank_routing_number'),
 (1, 'Bank of America', 198491827),
 (2, 'Wells Fargo', 629873495),
 (3, 'JPMorgan Chase', 2340903984),
 (4, 'Citigroup', 890123900),
 (5, 'TD Bank', 905192010),
 (6, 'Capital One', 184619239),
 (7, 'Ally Bank', 316289502),
 (8, 'Discover Bank', 639893944),
 (9, 'Bank of New York Mellon', 8734569384),
 (10, 'Royal Bank of Canada', 345826917)]

## 6. Using a SQL `SELECT` statement, find the bank routing number where the bank name equals 'TD Bank'.

In [12]:
# Select TD Bank's routing number
sql_select = """
SELECT bank_routing_number
FROM banks
WHERE bank_name = 'TD Bank'
"""

In [13]:
# Execute the sql statement
td_routing = engine.execute(sql_select)

2022-02-10 20:26:22,918 INFO sqlalchemy.engine.Engine
SELECT bank_routing_number
FROM banks
WHERE bank_name = 'TD Bank'

2022-02-10 20:26:22,925 INFO sqlalchemy.engine.Engine [raw sql] ()

In [14]:
# List the TD routing number
list(td_routing)

[(905192010,)]

## 7. Insert a new bank into the `banks` table. Once the query has been executed, confirm that the bank has been added to the list.

   * Use a '10' for the `bank_id`.
   * The bank name will be 'Royal Bank of Canada'.
   * The bank routing number will be '345826917'.

In [21]:
# Insert a new bank, Royal Bank of Canada with a bank id of 10 and a routing number of 345826917
sql_insert = """
INSERT OR IGNORE INTO banks
('bank_id', 'bank_name', 'bank_routing_number')
VALUES
('10', 'Royal Bank of Canada', '345826917')
"""

In [22]:
# Execute the sql statement
engine.execute(sql_insert)

2022-02-10 20:30:33,091 INFO sqlalchemy.engine.Engine
INSERT OR IGNORE INTO banks
('bank_id', 'bank_name', 'bank_routing_number')
VALUES
('10', 'Royal Bank of Canada', '345826917')

2022-02-10 20:30:33,091 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-02-10 20:30:33,092 INFO sqlalchemy.engine.Engine COMMIT

In [23]:
# List the banks to confirm the new bank was added
list(engine.execute('SELECT * FROM banks'))

2022-02-10 20:30:35,390 INFO sqlalchemy.engine.Engine SELECT * FROM banks
2022-02-10 20:30:35,390 INFO sqlalchemy.engine.Engine [raw sql] ()

[('bank_id', 'bank_name', 'bank_routing_number'),
 (1, 'Bank of America', 198491827),
 (2, 'Wells Fargo', 629873495),
 (3, 'JPMorgan Chase', 2340903984),
 (4, 'Citigroup', 890123900),
 (5, 'TD Bank', 905192010),
 (6, 'Capital One', 184619239),
 (7, 'Ally Bank', 316289502),
 (8, 'Discover Bank', 639893944),
 (9, 'Bank of New York Mellon', 8734569384),
 (10, 'Royal Bank of Canada', 345826917)]

## 8. `WHERE` the bank id equals 10, `UPDATE` the bank name to 'RBC'. Confirm that the bank name has been updated.

In [35]:
# For the bank with and id of 10, update the bank name to 'RBC'
sql_update = """
UPDATE banks
SET bank_name = 'RBC'
WHERE bank_id = '10'
"""

In [36]:
# Execute the sql statement
engine.execute(sql_update)

2022-02-10 20:36:55,046 INFO sqlalchemy.engine.Engine
UPDATE banks
SET bank_name = 'RBC'
WHERE bank_id = '10'

2022-02-10 20:36:55,047 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-02-10 20:36:55,048 INFO sqlalchemy.engine.Engine COMMIT

In [37]:
# List the banks to confirm that the bank was updated
list(engine.execute('SELECT * FROM banks'))

2022-02-10 20:36:55,210 INFO sqlalchemy.engine.Engine SELECT * FROM banks
2022-02-10 20:36:55,210 INFO sqlalchemy.engine.Engine [raw sql] ()

[('bank_id', 'bank_name', 'bank_routing_number'),
 (1, 'Bank of America', 198491827),
 (2, 'Wells Fargo', 629873495),
 (3, 'JPMorgan Chase', 2340903984),
 (4, 'Citigroup', 890123900),
 (5, 'TD Bank', 905192010),
 (6, 'Capital One', 184619239),
 (7, 'Ally Bank', 316289502),
 (8, 'Discover Bank', 639893944),
 (9, 'Bank of New York Mellon', 8734569384),
 (10, 'RBC', 345826917)]

## 9. `DELETE` the bank where the bank id equals to 3 from `banks` table. Confirm that the bank has been deleted.

In [38]:
# Delete bank_id = 3 from the banks table
sql_delete = """
DELETE FROM banks
WHERE bank_id = 3
"""

In [39]:
# Execute the sql statement
engine.execute(sql_delete)

2022-02-10 20:38:27,951 INFO sqlalchemy.engine.Engine
DELETE FROM banks
WHERE bank_id = 3

2022-02-10 20:38:27,952 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-02-10 20:38:27,956 INFO sqlalchemy.engine.Engine COMMIT

In [42]:
# List the banks to confirm the bank was deleted
list(engine.execute('SELECT * FROM banks'))

2022-02-10 20:38:38,284 INFO sqlalchemy.engine.Engine SELECT * FROM banks
2022-02-10 20:38:38,284 INFO sqlalchemy.engine.Engine [raw sql] ()

[('bank_id', 'bank_name', 'bank_routing_number'),
 (1, 'Bank of America', 198491827),
 (2, 'Wells Fargo', 629873495),
 (4, 'Citigroup', 890123900),
 (5, 'TD Bank', 905192010),
 (6, 'Capital One', 184619239),
 (7, 'Ally Bank', 316289502),
 (8, 'Discover Bank', 639893944),
 (9, 'Bank of New York Mellon', 8734569384),
 (10, 'RBC', 345826917)]